{
    "clothing":[
        {
            "img":"https://img.flawlessfiles.com/_r/300x400/100/bc/d8/bcd84731a3eda4f4a306250769675065/bcd84731a3eda4f4a306250769675065.jpg",
            "name":"One Piece",
            "Main Character":"Monkey D. Luffy",
            "category":"Fantacy, Adventure,Science Fiction",
            "decription":"Gold Roger was known as 'The Pirate King', the strongest and most infamous being to have sailed the Grand Line. The capture and execution of Roger by the World Government brought a change throughout the world. His last words before his death revealed the existence of the greatest treasure in the world, One Piece. It was this revelation that brought about the Grand Age of Pirates, men who dreamed of finding One Piece—which promises an unlimited amount of riches and fame—and quite possibly the pinnacle of glory and the title of the Pirate King. Enter Monkey Luffy, a 17-year-old boy who defies your standard definition of a pirate. Rather than the popular persona of a wicked, hardened, toothless pirate ransacking villages for fun, Luffy's reason for being a pirate is one of pure wonder: the thought of an exciting adventure that leads him to intriguing people and ultimately, the promised treasure. Following in the footsteps of his childhood hero, Luffy and his crew travel across the Grand Line, experiencing crazy adventures, unveiling dark mysteries and battling strong enemies, all in order to reach the most coveted of all fortunes—One Piece.",
            "Cast":"",
            "img2":"https://upload.wikimedia.org/wikipedia/en/thumb/9/90/One_Piece%2C_Volume_61_Cover_%28Japanese%29.jpg/220px-One_Piece%2C_Volume_61_Cover_%28Japanese%29.jpg",
            "status": " Airing",
            "episodes": "1100",
            "id":"1",
            "link":"https://aniwatchtv.to/watch/one-piece-100?ep=2142",
            "rating":"8.9",
            "arc1":"East-Blue Saga (0-61),",
            "arc2":"Alabasta Saga (61-135)",
            "arc3":"Sky Island Saga (136-206)",
            "arc4":"Water 7 Saga(207-325)",
            "arc5":"Thriller Bark Saga(326-384)",
            "arc6":"Summit War Saga(385-516)",
            "arc7":"FishMan Island Saga(517-574)",
            "arc8":"Dressrosa Saga(575-746)",
            "arc9":"whole Cake Island Saga(747-889)",
            "arc10":"Wano country Saga(810-Ongoing)"
            

            
        },
        {
            "link":"https://aniwatchtv.to/watch/naruto-677?ep=12352",
            "img":"https://img.flawlessfiles.com/_r/300x400/100/5d/b4/5db400c33f7494bc8ae96f9e634958d0/5db400c33f7494bc8ae96f9e634958d0.jpg",
            "name":"Naruto ",
            "Main Character":"Naruto Uzumaki",
            "category":"Adventure, Comedy, Martial Arts",
            "img2":"https://upload.wikimedia.org/wikipedia/en/thumb/9/94/NarutoCoverTankobon1.jpg/220px-NarutoCoverTankobon1.jpg",
            "status":"Finished Airing",
            "episodes":"220",
            "decription":"Moments prior to Naruto Uzumaki's birth, a huge demon known as the Kyuubi, the Nine-Tailed Fox, attacked Konohagakure, the Hidden Leaf Village, and wreaked havoc. In order to put an end to the Kyuubi's rampage, the leader of the village, the Fourth Hokage, sacrificed his life and sealed the monstrous beast inside the newborn Naruto. Now, Naruto is a hyperactive and knuckle-headed ninja still living in Konohagakure. Shunned because of the Kyuubi inside him, Naruto struggles to find his place in the village, while his burning desire to become the Hokage of Konohagakure leads him not only to some great new friends, but also some deadly foes. ",
            "Cast":"",
            "id":"2",
            "rating":"8.4",
            "arc1":"Land of Waves(1-19)",
            "arc2":"Chunin Exams(20-67)",
            "arc3":"Konoha Crush(68-80)",
            "arc4":"Search For Tsunade(81-100)",
            "arc5":"Land of Tea Escort Mission(101-106)",
            "arc6":"Sasuke Recovery Mission(107-135)",
            "arc7":"Filler Arcs(136-220)"
       },
       
        {
            "rating":"8.7",
            "link":"https://aniwatchtv.to/watch/naruto-shippuden-355?ep=7882",
             "img":"https://img.flawlessfiles.com/_r/300x400/100/9c/bc/9cbcf87f54194742e7686119089478f8/9cbcf87f54194742e7686119089478f8.jpg",
             "name":"Naruto Shippuden",
             "Main Character":"Naruto Uzumaki",
             "category":" Adventure, Fantasy,  Martial Arts",
             "decription":"It has been two and a half years since Naruto Uzumaki left Konohagakure, the Hidden Leaf Village, for intense training following events which fueled his desire to be stronger. Now Akatsuki, the mysterious organization of elite rogue ninja, is closing in on their grand plan which may threaten the safety of the entire shinobi world. Although Naruto is older and sinister events loom on the horizon, he has changed little in personality—still rambunctious and childish—though he is now far more confident and possesses an even greater determination to protect his friends and home. Come whatever may, Naruto will carry on with the fight for what is important to him, even at the expense of his own body, in the continuation of the saga about the boy who wishes to become Hokage",
             "Cast":"",
             "status":"Finished Airing",
             "episodes":"500",
             "img2":"https://upload.wikimedia.org/wikipedia/en/thumb/4/49/Shippudenkeyvisual.png/220px-Shippudenkeyvisual.png",
             "id":"3",
             "arc1":"Kazekage Rescue Mission(1-12)",
            "arc2":"Sasuke & Sai(33-71)",
            "arc3":"Itachi Pursuit Mission (113-151)",
            "arc4":"Pain Assult (152-196)",
            "arc5":"Fourth Shinobi War(215-500)"

        },
        {
            "rating":"9.0",
            "link":"https://aniwatchtv.to/watch/attack-on-titan-112?ep=3303",
            "img":"https://img.flawlessfiles.com/_r/300x400/100/de/bf/debf027d032c6d40b91fab16b2ff9bd4/debf027d032c6d40b91fab16b2ff9bd4.jpg",
            "name":"Attack On Titan",
            "Main Character":"Eren Yeager",
            "category":"Action, Dark Fantacy, Post-Apocalyptic",
            "decription":"Centuries ago, mankind was slaughtered to near extinction by monstrous humanoid creatures called titans, forcing humans to hide in fear behind enormous concentric walls. What makes these giants truly terrifying is that their taste for human flesh is not born out of hunger but what appears to be out of pleasure. To ensure their survival, the remnants of humanity began living within defensive barriers, resulting in one hundred years without a single titan encounter. However, that fragile calm is soon shattered when a colossal titan manages to breach the supposedly impregnable outer wall, reigniting the fight for survival against the man-eating abominations. After witnessing a horrific personal loss at the hands of the invading creatures, Eren Yeager dedicates his life to their eradication by enlisting into the Survey Corps, an elite military unit that combats the merciless humanoids outside the protection of the walls. Based on Hajime Isayama's award-winning manga, Shingeki no Kyojin follows Eren, along with his adopted sister Mikasa Ackerman and his childhood friend Armin Arlert, as they join the brutal war against the titans and race to discover a way of defeating them before the last walls are breached. ",
            "img2":"https://img.flawlessfiles.com/_r/300x400/100/f8/b7/f8b79c1c7b8153e7b5c64f0cf8b959ef/f8b79c1c7b8153e7b5c64f0cf8b959ef.jpg",
            "Cast":"",
            "status":"Finished Airing",
            "episodes":"91",
            "id":"4",
            "arc1":"Fall of Shiganshina (1-2)",
            "arc2":"Battle of Trost District Arc (3-13)",
            "arc3":"Female Titan Arc (14-25)",
            "arc4":"Clash of Titans (26-37)",
            "arc5":"Uprising Arc (38-49)",
            "arc6":"Marley Arc (60-67)",
            "arc7":"War for Paradis( 68-87)",
            "arc8":"The Rumbling (88-89)",
            "arc9":"Final Chapters (90-91)"
        },
        {
            "rating":"9.0",
            "link":"https://aniwatchtv.to/watch/death-note-60?ep=1464",
            "img2":"https://upload.wikimedia.org/wikipedia/en/thumb/6/6f/Death_Note_Vol_1.jpg/220px-Death_Note_Vol_1.jpg",
            "name":"Death Note",
            "Main Character":"Yagami Light",
            "category":"Mystery, Psychological Thriller",
            "decription":"A shinigami, as a god of death, can kill any person—provided they see their victim's face and write their victim's name in a notebook called a Death Note. One day, Ryuk, bored by the shinigami lifestyle and interested in seeing how a human would use a Death Note, drops one into the human realm. High school student and prodigy Light Yagami stumbles upon the Death Note and—since he deplores the state of the world—tests the deadly notebook by writing a criminal's name in it. When the criminal dies immediately following his experiment with the Death Note, Light is greatly surprised and quickly recognizes how devastating the power that has fallen into his hands could be. With this divine capability, Light decides to extinguish all criminals in order to build a new world where crime does not exist and people worship him as a god. Police, however, quickly discover that a serial killer is targeting criminals and, consequently, try to apprehend the culprit. To do this, the Japanese investigators count on the assistance of the best detective in the world: a young and eccentric man known only by the name of L.",
            "Cast":"",
            "img":"https://img.flawlessfiles.com/_r/300x400/100/5e/61/5e61f3e7c0045e46b670d31a5bb39c68/5e61f3e7c0045e46b670d31a5bb39c68.jpg",
            "episodes":"37",
            "status":"Finished Airing",
            "id":"5",
            "arc1":"Introduction Arc (1-7)",
            "arc2":"Yotsuba Arc(8-19)",
            "arc3":"L's Investigation Arc (20-25)",
            "arc4":"Nello Mello Arc(26-37)",
            "arc5":"Conclusion Arc (36-37)"
                  },
        {
             "rating":"9.0",
             "link":"https://aniwatchtv.to/watch/hunter-x-hunter-2?ep=65",
             "img":"https://img.flawlessfiles.com/_r/300x400/100/99/3c/993c0361975cce4c7fbb11f8558f9664/993c0361975cce4c7fbb11f8558f9664.jpg",
             "img2":"https://upload.wikimedia.org/wikipedia/en/thumb/e/e8/Hunter_%C3%97_Hunter_vol._1.png/220px-Hunter_%C3%97_Hunter_vol._1.png",
             "name":"Hunter X Hunter",
             "Main Character":"Gon Freeces",
             "category":"Fantacy,Martial Arts, Adventure",
             "decription":"Hunter x Hunter is set in a world where Hunters exist to perform all manner of dangerous tasks like capturing criminals and bravely searching for lost treasures in uncharted territories. Twelve-year-old Gon Freecss is determined to become the best Hunter possible in hopes of finding his father, who was a Hunter himself and had long ago abandoned his young son. However, Gon soon realizes the path to achieving his goals is far more challenging than he could have ever imagined. Along the way to becoming an official Hunter, Gon befriends the lively doctor-in-training Leorio, vengeful Kurapika, and rebellious ex-assassin Killua. To attain their own goals and desires, together the four of them take the Hunter Exam, notorious for its low success rate and high probability of death. Throughout their journey, Gon and his friends embark on an adventure that puts them through many hardships and struggles. They will meet a plethora of monsters, creatures, and characters—all while learning what being a Hunter truly means. ",
             "Cast":"",
             "episodes":"148",
             "status":"Finished Airing",
             "id":"6",
             "arc1":"Hunter Exam Arc (1-21)",
            "arc2":"Zoldyck Family Arc (22-26)",
            "arc3":"Heavens Arena Arc (27-36)",
            "arc4":"YorkNew City Arc (37-58)",
            "arc5":"Greed Island Arc (59-75)",
            "arc6":"Chimera Ant Arc (76-136)",
            "arc7":"Election Arc (137-148)"
       },
       {
            "rating":"8.8",
            "link":"https://aniwatchtv.to/watch/vinland-saga-40?ep=1134",
            "img2":"https://upload.wikimedia.org/wikipedia/en/thumb/5/51/Vinland_Saga_volume_01_cover.jpg/220px-Vinland_Saga_volume_01_cover.jpg",
            "name":"Vinland Saga",
            "Main Character":"Thorfinn Thors",
            "img":"https://img.flawlessfiles.com/_r/300x400/100/9c/c8/9cc864ccccce7f38f7a100627ef21516/9cc864ccccce7f38f7a100627ef21516.jpg",
            "category":"Epic, Adventure,Historical",
            "decription":"Young Thorfinn grew up listening to the stories of old sailors that had traveled the ocean and reached the place of legend, Vinland. It's said to be warm and fertile, a place where there would be no need for fighting—not at all like the frozen village in Iceland where he was born, and certainly not like his current life as a mercenary. War is his home now. Though his father once told him, 'You have no enemies, nobody does. There is nobody who it's okay to hurt,'as he grew, Thorfinn knew that nothing was further from the truth. The war between England and the Danes grows worse with each passing year. Death has become commonplace, and the viking mercenaries are loving every moment of it. Allying with either side will cause a massive swing in the balance of power, and the vikings are happy to make names for themselves and take any spoils they earn along the way. Among the chaos, Thorfinn must take his revenge and kill Askeladd, the man who murdered his father. The only paradise for the vikings, it seems, is the era of war and death that rages on",
            "Cast":"",
            "episodes":"48",
            "status":"Finished Airing",
            "id":"7"
       },
       {
            "rating":"8.7",
            "link":"https://aniwatchtv.to/watch/demon-slayer-kimetsu-no-yaiba-47?ep=1279",
            "img":"https://img.flawlessfiles.com/_r/300x400/100/30/df/30df93feaa422101659e14d0a2a2f582/30df93feaa422101659e14d0a2a2f582.jpg",
            "name":"Demon Slayer",
            "Main Character":"Tanjiro Kamado",
            "category":"Dark Fantacy,Martial Arts, Adventure",
            "decription":"Ever since the death of his father, the burden of supporting the family has fallen upon Tanjirou Kamado's shoulders. Though living impoverished on a remote mountain, the Kamado family are able to enjoy a relatively peaceful and happy life. One day, Tanjirou decides to go down to the local village to make a little money selling charcoal. On his way back, night falls, forcing Tanjirou to take shelter in the house of a strange man, who warns him of the existence of flesh-eating demons that lurk in the woods at night. When he finally arrives back home the next day, he is met with a horrifying sight—his whole family has been slaughtered. Worse still, the sole survivor is his sister Nezuko, who has been turned into a bloodthirsty demon. Consumed by rage and hatred, Tanjirou swears to avenge his family and stay by his only remaining sibling. Alongside the mysterious group calling themselves the Demon Slayer Corps, Tanjirou will do whatever it takes to slay the demons and protect the remnants of his beloved sister's humanity. ",
            "Cast":"",
            "status":"Finished Airing",
            "episodes":"55",
            "img2":"https://img.flawlessfiles.com/_r/300x400/100/b5/02/b5020a13530f648be6f59e64f4ec78c3/b5020a13530f648be6f59e64f4ec78c3.jpg",
            "id":"8",
            "arc1":"Season 1 (1-26)",
            "arc2":"Mugen Train Arc (27-34)",
            "arc3":"Entertainment District Arc (34-22)",
            "arc4":"Swordsmith Village Arc (45-57)",
            "arc5":"Hashira Training Arc (58-65)"
       },
       {
            "rating":"8.3",
            "link":"https://aniwatchtv.to/watch/black-clover-2404?ep=27377",
            "img":"https://img.flawlessfiles.com/_r/300x400/100/f5/8b/f58b0204c20ae3310f65ae7b8cb9987e/f58b0204c20ae3310f65ae7b8cb9987e.jpg",
            "episodes":"170",
            "status":"Pending",
            "img2":"https://upload.wikimedia.org/wikipedia/en/thumb/6/69/Black_Clover%2C_volume_1.jpg/220px-Black_Clover%2C_volume_1.jpg",
            "name":"Black Clover",
            "Main Character":"Asta",
            "category":"Fantasy, Adventure",
            "decription":"Asta and Yuno were abandoned at the same church on the same day. Raised together as children, they came to know of the 'Wizard King'—a title given to the strongest mage in the kingdom—and promised that they would compete against each other for the position of the next Wizard King. However, as they grew up, the stark difference between them became evident. While Yuno is able to wield magic with amazing power and control, Asta cannot use magic at all and desperately tries to awaken his powers by training physically. When they reach the age of 15, Yuno is bestowed a spectacular Grimoire with a four-leaf clover, while Asta receives nothing. However, soon after, Yuno is attacked by a person named Lebuty, whose main purpose is to obtain Yuno's Grimoire. Asta tries to fight Lebuty, but he is outmatched. Though without hope and on the brink of defeat, he finds the strength to continue when he hears Yuno's voice. Unleashing his inner emotions in a rage, Asta receives a five-leaf clover Grimoire, a 'Black Clover' giving him enough power to defeat Lebuty. A few days later, the two friends head out into the world, both seeking the same goal—to become the Wizard King!",
            "Cast":"",
            "id":"9",
            "arc1":"Magic Knights Entrance Arc (1-13)",
            "arc2":"Dungeon Exploration Arc (14-19)",
            "arc3":"Royal Capital Arc (20-27)",
            "arc4":"Eye of Tge Midknight Sun Arc(28-39)",
            "arc5":"Witches Forest Arc (51-65)",
            "arc6":"Royal Knights Arc (66-90)",
            "arc7":"Elf Reincarnation Arc (91-120)",
            "arc8":"Heart KingdomnJoint Struggle (121-129)",
            "arc9":"Spade Kingdom Arc (130-170)",
            "arc10":"Clover Kimgdom vs Spade Kingdom Arc (158-170)"
       },
       {
        "rating":"/",
        "link":"https://aniwatchtv.to/watch/solo-leveling-18718?ep=114721",
        "img":"https://img.flawlessfiles.com/_r/300x400/100/b1/47/b147d331e311a5d5c8ee81269725fc92/b147d331e311a5d5c8ee81269725fc92.png",
        "img2":"https://upload.wikimedia.org/wikipedia/en/thumb/6/6c/Solo_Leveling_Volume_1_Cover.jpg/220px-Solo_Leveling_Volume_1_Cover.jpg",
        "episodes":"12",
        "status":"Pending",
        "name":"Solo Levelling",
        "Main Character":"Sun Jin-Woo",
        "category":"Action, Fantasy,",
        "decription":"Humanity was caught at a precipice a decade ago when the first gates—portals linked with other dimensions that harbor monsters immune to conventional weaponry—emerged around the world. Alongside the appearance of the gates, various humans were transformed into hunters and bestowed superhuman abilities. Responsible for entering the gates and clearing the dungeons within, many hunters chose to form guilds to secure their livelihoods. Sung Jin-Woo is an E-rank hunter dubbed as the weakest hunter of all mankind. While exploring a supposedly safe dungeon, he and his party encounter an unusual tunnel leading to a deeper area. Enticed by the prospect of treasure, the group presses forward, only to be confronted with horrors beyond their imagination. Miraculously, Jin-Woo survives the incident and soon finds that he now has access to an interface visible only to him. This mysterious system promises him the power he has long dreamed of—but everything comes at a price.",
        "Cast":"",
        "id":"10",
        "arc1":"Season 1"
      },
      {
        "rating":"/",
        "link":"https://aniwatchtv.to/watch/kaiju-no-8-19145?ep=123344",
        "img":"https://img.flawlessfiles.com/_r/300x400/100/ed/fc/edfc7fe935b6eac2d704cf5b0a60e356/edfc7fe935b6eac2d704cf5b0a60e356.jpg",
        "img2":"https://upload.wikimedia.org/wikipedia/en/thumb/c/cd/Kaiju_No_8.jpg/220px-Kaiju_No_8.jpg",
        "name":"Kaiju No.8",
        "Main Character":"Kafka Hibino",
        "category":"Fantasy, Adventure,Science",
        "decription":"After the destruction of their hometown, childhood friends Kafka Hibino and Mina Ashiro make a pact to become officers in the Defense Force—a militarized organization tasked with protecting Japan from colossal monsters known as 'kaijuu.' Decades later, the 32-year-old Kafka has all but given up on his dreams of heroism. Instead, he cleans up the remains of the slaughtered kaijuu after they are defeated by valiant soldiers—including Mina, who has successfully achieved their shared goal. Upon meeting his new coworker, Reno Ichikawa, Kafka faces a mirror of his past self: an ambitious young man whose one desire is to fight as a member of the Defense Force. Unfortunately, the two are soon involved in a freak encounter with a rogue kaijuu. Though Kafka demonstrates his innate heroic nature and rescues Reno from certain doom, he is left gravely injured. While both men recover in a hospital, Kafka is seemingly attacked by another one of the beasts. As a result, he gains the ability to transform into a humanoid kaijuu with the strength and powers of the massive monsters menacing Japan. Dubbed 'Kaijuu No. 8' by the military, Kafka resolves to use his newfound gifts for the greater good. Tied together by mutual respect, Kafka and Reno set out to join warriors like Mina at the forefront of the Defense Force. ",
        "Cast":"",
        "id":"11",
        "arc1":"Season 1"
     },
     {
        "rating":"8.4",
        "link":"https://aniwatchtv.to/watch/my-hero-academia-322?ep=6210",
        "img":"https://img.flawlessfiles.com/_r/300x400/100/af/49/af4938d7388aad3438e443e74b02531e/af4938d7388aad3438e443e74b02531e.jpg",
        "img2":"https://upload.wikimedia.org/wikipedia/en/thumb/5/5a/Boku_no_Hero_Academia_Volume_1.png/220px-Boku_no_Hero_Academia_Volume_1.png",
        "episodes":"138",
        "status":" Airing",
        "name":"My Hero Academia",
        "Main Character":"Deku",
        "category":"SuperHero,Adventure,Fantacy",
        "decription":"The appearance of 'quirks,' newly discovered super powers, has been steadily increasing over the years, with 80 percent of humanity possessing various abilities from manipulation of elements to shapeshifting. This leaves the remainder of the world completely powerless, and Izuku Midoriya is one such individual. Since he was a child, the ambitious middle schooler has wanted nothing more than to be a hero. Izuku's unfair fate leaves him admiring heroes and taking notes on them whenever he can. But it seems that his persistence has borne some fruit: Izuku meets the number one hero and his personal idol, All Might. All Might's quirk is a unique ability that can be inherited, and he has chosen Izuku to be his successor! Enduring many months of grueling training, Izuku enrolls in UA High, a prestigious high school famous for its excellent hero training program, and this year's freshmen look especially promising. With his bizarre but talented classmates and the looming threat of a villainous organization, Izuku will soon learn what it really means to be a hero",
        "Cast":"",
        "id":"12",
        "arc1":"Season 1",
        "arc2":"Season 2",
        "arc3":"Season 3",
        "arc4":"Season 4",
        "arc5":"Season 5",
        "arc6":"Season 6",
        "arc7":"Season 7 (ongoing)"
    },
   {
    "rating":"8.7",
    "link":"https://aniwatchtv.to/watch/jujutsu-kaisen-tv-534?ep=10789",
    "img":"https://img.flawlessfiles.com/_r/300x400/100/82/40/82402f796b7d84d7071ab1e03ff7747a/82402f796b7d84d7071ab1e03ff7747a.jpg",
    "img2":"https://img.flawlessfiles.com/_r/300x400/100/b5/1f/b51f863b05f30576cf9d85fa9b911bb5/b51f863b05f30576cf9d85fa9b911bb5.png",
    "episodes":"48",
    "status":" Airing",
    "name":"Jujutsu Kaisen",
    "Main Character":"Itadori Yuji",
    "category":"Dark Fantacy,SuperNatural",
    "decription":"Idly indulging in baseless paranormal activities with the Occult Club, high schooler Yuuji Itadori spends his days at either the clubroom or the hospital, where he visits his bedridden grandfather. However, this leisurely lifestyle soon takes a turn for the strange when he unknowingly encounters a cursed item. Triggering a chain of supernatural occurrences, Yuuji finds himself suddenly thrust into the world of Curses—dreadful beings formed from human malice and negativity—after swallowing the said item, revealed to be a finger belonging to the demon Sukuna Ryoumen, the 'King of Curses.' Yuji experiences first-hand the threat these Curses pose to society as he discovers his own newfound powers. Introduced to the Tokyo Metropolitan Jujutsu Technical High School, he begins to walk down a path from which he cannot return—the path of a Jujutsu sorcerer.",
    "Cast":"",
    "id":"13",
    "arc1":"Season 1",
    "arc2":"Season 2"
    
   },
  {
    "rating":"8.1",
    "link":"https://aniwatchtv.to/watch/bleach-806?ep=13793",
    "img":"https://upload.wikimedia.org/wikipedia/en/thumb/7/72/Bleachanime.png/220px-Bleachanime.png",
    "img2":"https://img.flawlessfiles.com/_r/300x400/100/bd/5a/bd5ae1d387a59c5abcf5e1a6a616728c/bd5ae1d387a59c5abcf5e1a6a616728c.jpg",
    "episodes":"366",
    "status":"Finished Airing",
    "name":"Bleach",
    "Main Character":"Ichigo Kurasaki",
    "category":"Martial Arts,Supernatural, Adventure",
    "decription":"Ichigo Kurosaki is an ordinary high schooler—until his family is attacked by a Hollow, a corrupt spirit that seeks to devour human souls. It is then that he meets a Soul Reaper named Rukia Kuchiki, who gets injured while protecting Ichigo's family from the assailant. To save his family, Ichigo accepts Rukia's offer of taking her powers and becomes a Soul Reaper as a result. However, as Rukia is unable to regain her powers, Ichigo is given the daunting task of hunting down the Hollows that plague their town. However, he is not alone in his fight, as he is later joined by his friends—classmates Orihime Inoue, Yasutora Sado, and Uryuu Ishida—who each have their own unique abilities. As Ichigo and his comrades get used to their new duties and support each other on and off the battlefield, the young Soul Reaper soon learns that the Hollows are not the only real threat to the human world.",
    "Cast":"",
    "id":"14",
    "arc1":"Agent Of Shinigami Arc (1-20)",
    "arc2":"Soul Society Arc (21-43)",
    "arc3":"The Arrancar Arc (92-316)",
    "arc4":"Lost Agent Arc(317-342)",
    "arc5":"Thousand-Year Blood War Arc (343-366)"
  },
  {
    "rating":"/",
    "link":"https://aniwatchtv.to/watch/wind-breaker-19136?ep=123203",
    "img":"https://img.flawlessfiles.com/_r/300x400/100/d9/bb/d9bb23228e5a641b5a3e9386382dae3a/d9bb23228e5a641b5a3e9386382dae3a.jpg",
    "img2":"https://upload.wikimedia.org/wikipedia/en/thumb/f/ff/Wind_Breaker_1.png/220px-Wind_Breaker_1.png",
    "episodes":"13",
    "status":" Airing",
       "name":"WindBreaker",
       "Main Character":"Haruka Sakura",
       "category":"Martial Arts,Yanki, Adventure",
       "decription":"From an early age, Haruka Sakura was made an outcast due to his unconventional appearance and lack of social skills. However, the rough treatment turned him into a proficient fighter, which is now the only thing he prides himself on. Starting at Furin High School, where it is rumored that strength is valued over academics, Sakura has only one goal—taking the top spot. Involved in a street brawl the day before his enrollment, Sakura happens to meet a group of his future schoolmates. Instead of the usual rejection, they fight alongside him, demonstrating that what the school actually cares about is protecting the town of Makochi from any harm—hence why the students call themselves 'Bofurin.' Surprised by the support and appreciation of the townspeople, Sakura has a hard time accepting their goodwill. Though unfamiliar with kindness being shown to him, Sakura must learn to push past his discomfort when Bofurin is pitted against formidable enemies. After experiencing the feeling of acceptance, he finds himself fighting for the sake of others for the first time. ",
       "Cast":"",
       "id":"15",
       "arc1":"Season 1"
  },
  {
       "rating":"9.1",
       "link":"https://aniwatchtv.to/watch/fullmetal-alchemist-308?ep=5791",
       "img":"https://img.flawlessfiles.com/_r/300x400/100/02/e1/02e12b85f54dc6711ed861a9913bb933/02e12b85f54dc6711ed861a9913bb933.jpg",
       "img2":"https://upload.wikimedia.org/wikipedia/en/thumb/9/9d/Fullmetal123.jpg/220px-Fullmetal123.jpg",
       "episodes":"115",
       "status":" Airing",
       "name":"Full Metal Alchemist",
       "Main Character":"Edward & Alphonse Elric",
       "category":"SteamPunk,Dark Fantacy, Adventure",
       "decription":"Edward Elric, a young, brilliant alchemist, has lost much in his twelve-year life: when he and his brother Alphonse try to resurrect their dead mother through the forbidden act of human transmutation, Edward loses his brother as well as two of his limbs. With his supreme alchemy skills, Edward binds Alphonse's soul to a large suit of armor. A year later, Edward, now promoted to the fullmetal alchemist of the state, embarks on a journey with his younger brother to obtain the Philosopher's Stone. The fabled mythical object is rumored to be capable of amplifying an alchemist's abilities by leaps and bounds, thus allowing them to override the fundamental law of alchemy: to gain something, an alchemist must sacrifice something of equal value. Edward hopes to draw into the military's resources to find the fabled stone and restore his and Alphonse's bodies to normal. However, the Elric brothers soon discover that there is more to the legendary stone than meets the eye, as they are led to the epicenter of a far darker battle than they could have ever imagined. ",
       "Cast":"",
       "id":"16",
       "arc1":"The Series",
       "arc2":"Movie 1:Conqueror of Shamballa",
       "arc3":"BrotherHood: The series",
       "arc4":"Movie 2: The Sacred Star of Milanos"
  },
  {
       "rating":"8.6",
       "link":"https://aniwatchtv.to/watch/code-geass-lelouch-of-the-rebellion-41?ep=1158",
       "img":"https://img.flawlessfiles.com/_r/300x400/100/b7/b1/b7b180ff8404f0475e60a4f3a0f5bd20/b7b180ff8404f0475e60a4f3a0f5bd20.jpg",
       "img2":"https://upload.wikimedia.org/wikipedia/en/thumb/7/74/Code_Geass_R1_box_set_cover.jpg/220px-Code_Geass_R1_box_set_cover.jpg",
       "episodes":"50",
       "status":" Finished",
       "name":"Code Geass",
       "Main Character":"Edward & Alphonse Elric",
       "category":"Mecha,Military,Ulitrimate History",
       "decription":"In the year 2010, the Holy Empire of Britannia is establishing itself as a dominant military nation, starting with the conquest of Japan. Renamed to Area 11 after its swift defeat, Japan has seen significant resistance against these tyrants in an attempt to regain independence. Lelouch Lamperouge, a Britannian student, unfortunately finds himself caught in a crossfire between the Britannian and the Area 11 rebel armed forces. He is able to escape, however, thanks to the timely appearance of a mysterious girl named C.C., who bestows upon him Geass, the 'Power of Kings.' Realizing the vast potential of his newfound 'power of absolute obedience,' Lelouch embarks upon a perilous journey as the masked vigilante known as Zero, leading a merciless onslaught against Britannia in order to get revenge once and for all.  ",
       "Cast":"",
       "id":"17",
       "arc1":"Season 1 (1-25)",
       "arc2":"Season 2 (25-50)"
  },
  {
       "rating":"8.0",
       "link":"https://aniwatchtv.to/watch/fairy-tail-930?ep=15627",
       "img":"https://img.flawlessfiles.com/_r/300x400/100/cc/bc/ccbc20fd8ddf9b2000bf23894a787436/ccbc20fd8ddf9b2000bf23894a787436.jpg",
       "img2":"https://upload.wikimedia.org/wikipedia/en/thumb/e/e8/Fairy_Tail_100_Years_Quest%2C_Vol_1.jpg/220px-Fairy_Tail_100_Years_Quest%2C_Vol_1.jpg",
       "episodes":"328",
       "status":" Finished",
       "name":"Fairy Tail",
       "Main Character":"Lucy Heartfilia",
       "category":"Fantacy, Adventure",
       "decription":"In the mystical land of Fiore, magic exists as an essential part of everyday life. Countless magic guilds lie at the core of all magical activity, and serve as venues for like-minded mages to band together and take on job requests. Among them, Fairy Tail stands out from the rest as a place of strength, spirit, and family. Lucy Heartfilia is a young mage searching for celestial gate keys, and her dream is to become a full-fledged wizard by joining this famous guild. In her search, she runs into Natsu Dragneel and his partner Happy, who are on a quest to find Natsu's foster father, the dragon Igneel. Upon being tricked by a man, Lucy falls under an abduction attempt, only to be saved by Natsu. To her shock, he reveals that he is a member of Fairy Tail and invites her to join them. There, Lucy meets the guild's strange members, such as the ice wizard Gray Fullbuster and magic swordswoman Erza Scarlet. Together as a family, they battle the forces of evil, help those in need, and gain new friends, all the while enjoying the never-ending adventure that is Fairy Tail",
       "Cast":"",
       "id":"18",
       "arc1":"Series 1 (1-175)",
       "arc2":"Series 2 (175-277)",
       "arc3":"The Final Series (278-328)"
  },
  {
       "rating":"7.8",
       "link":"https://aniwatchtv.to/watch/boruto-naruto-next-generations-8143?ep=47085",
       "img":"https://img.flawlessfiles.com/_r/300x400/100/32/c8/32c83e2ad4a43229996356840db3982c/32c83e2ad4a43229996356840db3982c.jpg",
       "img2":"https://upload.wikimedia.org/wikipedia/en/thumb/d/db/Boruto_manga_vol_1.jpg/220px-Boruto_manga_vol_1.jpg",
       "episodes":"273",
       "status":" Airing",
       "name":"Boruto",
       "Main Character":"Boruto Uzumaki",
       "category":"Fantasy, Adventure",
       "decription":"Following the successful end of the Fourth Shinobi World War, Konohagakure has been enjoying a period of peace, prosperity, and extraordinary technological advancement. This is all due to the efforts of the Allied Shinobi Forces and the village's Seventh Hokage, Naruto Uzumaki. Now resembling a modern metropolis, Konohagakure has changed, particularly the life of a shinobi. Under the watchful eye of Naruto and his old comrades, a new generation of shinobi has stepped up to learn the ways of the ninja. Boruto Uzumaki is often the center of attention as the son of the Seventh Hokage. Despite having inherited Naruto's boisterous and stubborn demeanor, Boruto is considered a prodigy and is able to unleash his potential with the help of supportive friends and family. Unfortunately, this has only worsened his arrogance and his desire to surpass Naruto which, along with his father's busy lifestyle, has strained their relationship. However, a sinister force brewing within the village may threaten Boruto's carefree life. New friends and familiar faces join Boruto as a new story begins in Boruto: Naruto Next Generations.  ",
       "Cast":"",
       "id":"19",
       "arc1":"Introduction Arc (1-16)",
       "arc2":"Chunin Exams (17-56)",
       "arc3":"Versus Momoshiki Arc (57-66)",
       "arc4":"Kara Actuation Arc (67-66)",
       "arc5":"Ao Arc (77-92)",
       "arc6":"Shin Uchiha Arc (93-102)",
       "arc7":"Mitsusuki Disappearance Arc (103-115)",
       "arc8":"Kara Invasion Arc (116-133)",
       "arc9":"Kara Actuation Arc Arc (134-155)",
       "arc10":"Shin Uchiha Arc [Continued] (156-175)",
       "arc11":"BoruSara Arc (175-293)",
       "arc12":"Ongoing Arc"
  },
  {
       "rating":"/",
       "link":"https://aniwatchtv.to/watch/baki-2649?ep=28915",
       "img":"https://img.flawlessfiles.com/_r/300x400/100/4f/e7/4fe77589bb2ca6f2857ba863c1d78f3e/4fe77589bb2ca6f2857ba863c1d78f3e.jpg",
       "img2":"https://upload.wikimedia.org/wikipedia/en/thumb/7/7d/Baki_2018_Key_Visual.jpg/220px-Baki_2018_Key_Visual.jpg",
       "episodes":"98",
       "status":" Finished",
       "name":"Baki",
       "Main Character":"Baki Hanma",
       "category":"Dark Fantacy, Action",
       "decription":"After emerging victorious from a brutal underground tournament, Baki Hanma continues on his path to defeat his father, Yuujirou, the strongest man in the world. However, he gets no time to rest when the tournament runner, Tokugawa Mitsunari, visits him at school. He reveals to Baki that five incredibly dangerous death row inmates from around the world—all skilled in martial arts—have simultaneously escaped confinement and are heading to Tokyo, each wishing to finally know the taste of defeat. Tokugawa warns that, due to his well-known strength, Baki is bound to encounter them sooner or later, and he will not be their only target. Adapting the first saga of the second manga series, Baki centers on the all-out war between the esteemed martial artists of Japan and those of the dark underground world.",
       "Cast":"",
       "id":"20",
       "arc1":"Baki The Grapller (1-24)",  
       "arc2":"The Search for The Strongest (1-48)",
       "arc3":"Maximum Tournament (1-24)",
       "arc4":"Baki III (1-24)",
       "arc5":"Baki 2018 (1-26)",
       "arc6":"Baki Hanma Son Of Ogre [2021] (1-12)"
  },
  {
       "rating":"8.9",
       "link":"https://aniwatchtv.to/watch/cowboy-bebop-27?ep=849",
       "img":"https://img.flawlessfiles.com/_r/300x400/100/ce/5e/ce5e539af63e42431621fc66a47fbec1/ce5e539af63e42431621fc66a47fbec1.jpg",
       "img2":"https://upload.wikimedia.org/wikipedia/en/thumb/a/a9/Cowboy_Bebop_key_visual.jpg/220px-Cowboy_Bebop_key_visual.jpg",
       "episodes":"26",
       "status":" Finished",
       "name":"Cowboy Bepop",
       "Main Character":"Spike Spiegel",
       "category":"Neo-Noir,Space Western",
       "decription":"n the year 2071, humanity has colonized several of the planets and moons of the solar system leaving the now uninhabitable surface of planet Earth behind. The Inter Solar System Police attempts to keep peace in the galaxy, aided in part by outlaw bounty hunters, referred to as 'Cowboys'. The ragtag team aboard the spaceship Bebop are two such individuals. Mellow and carefree Spike Spiegel is balanced by his boisterous, pragmatic partner Jet Black as the pair makes a living chasing bounties and collecting rewards. Thrown off course by the addition of new members that they meet in their travels—Ein, a genetically engineered, highly intelligent Welsh Corgi; femme fatale Faye Valentine, an enigmatic trickster with memory loss; and the strange computer whiz kid Edward Wong—the crew embarks on thrilling adventures that unravel each member's dark and mysterious past little by little. Well-balanced with high density action and light-hearted comedy, Cowboy Bebop is a space Western classic and an homage to the smooth and improvised music it is named after.",
       "Cast":"",
       "id":"21",
       "arc1":"Season 1 (1-26)"
  },
  {
       "rating":"8.5",
       "link":"https://aniwatchtv.to/watch/mob-psycho-100-101?ep=3087",
       "img2":"https://upload.wikimedia.org/wikipedia/en/thumb/4/4b/Mob_Psycho_100_manga_vol_1.jpg/220px-Mob_Psycho_100_manga_vol_1.jpg",
       "img":"https://img.flawlessfiles.com/_r/300x400/100/3f/20/3f20ed9108a583429fd687f986a617e0/3f20ed9108a583429fd687f986a617e0.jpg",
       "episodes":"37",
       "status":" Finished",
       "name":"Mob Psycho 100",
       "Main Character":"Shigeo Kageyama",
       "category":"Action,Comedy,SuperNatural",
       "decription":"Eighth-grader Shigeo ;Mob' Kageyama has tapped into his inner wellspring of psychic prowess at a young age. But the power quickly proves to be a liability when he realizes the potential danger in his skills. Choosing to suppress his power, Mob's only present use for his ability is to impress his longtime crush, Tsubomi, who soon grows bored of the same tricks. In order to effectuate control on his skills, Mob enlists himself under the wing of Arataka Reigen, a con artist claiming to be a psychic, who exploits Mob's powers for pocket change. Now, exorcising evil spirits on command has become a part of Mob's daily, monotonous life. However, the psychic energy he exerts is barely the tip of the iceberg; if his vast potential and unrestrained emotions run berserk, a cataclysmic event that would render him completely unrecognizable will be triggered. The progression toward Mob's explosion is rising and attempting to stop it is futile. ",
       "Cast":"",
       "id":"22",
       "arc1":"Season 1 (1-12)",
       "arc2":"Season 2 (13-26)",
       "arc3":"Season 3 (27-37)"
  },
  {
       "rating":"8.8",
       "link":"https://aniwatchtv.to/watch/one-punch-man-63?ep=1501",
       "img":"https://img.flawlessfiles.com/_r/300x400/100/f5/d1/f5d173f8317f592c6c70d594829b89e4/f5d173f8317f592c6c70d594829b89e4.jpg",
       "img2":"https://upload.wikimedia.org/wikipedia/en/thumb/c/c3/OnePunchMan_manga_cover.png/220px-OnePunchMan_manga_cover.png",
       "episodes":"24",
       "status":" Airing",
       "name":"One Punch Man",
       "Main Character":"Saitama",
       "category":"Action, Comedy,SuperHero",
       "decription":"The seemingly ordinary and unimpressive Saitama has a rather unique hobby: being a hero. In order to pursue his childhood dream, he trained relentlessly for three years—and lost all of his hair in the process. Now, Saitama is incredibly powerful, so much so that no enemy is able to defeat him in battle. In fact, all it takes to defeat evildoers with just one punch has led to an unexpected problem—he is no longer able to enjoy the thrill of battling and has become quite bored. This all changes with the arrival of Genos, a 19-year-old cyborg, who wishes to be Saitama's disciple after seeing what he is capable of. Genos proposes that the two join the Hero Association in order to become certified heroes that will be recognized for their positive contributions to society, and Saitama, shocked that no one knows who he is, quickly agrees. And thus begins the story of One Punch Man, an action-comedy that follows an eccentric individual who longs to fight strong enemies that can hopefully give him the excitement he once felt and just maybe, he'll become popular in the process. ",
       "Cast":"",
       "id":"23",
       "arc1":"Season 1 (1-12)",
       "arc2":"Season 2 (13-26)"
  },
  {
       "rating":"7.7",
       "link":"https://aniwatchtv.to/watch/fire-force-979?ep=16169",
       "img":"https://img.flawlessfiles.com/_r/300x400/100/f6/d9/f6d9cbc5cc655c5600f296acb1138975/f6d9cbc5cc655c5600f296acb1138975.jpg",
       "img2":"https://upload.wikimedia.org/wikipedia/en/thumb/0/06/Fire_Force%2C_Volume_1.jpg/220px-Fire_Force%2C_Volume_1.jpg",
       "episodes":"48",
       "status":" Airing",
       "name":"Fire Force",
       "Main Character":"Shinra Kusakabe",
       "category":"Science Fantasy,Dark Fantacy, Adventure",
       "decription":"Spontaneous Human Combustion: a chaotic phenomenon that has plagued humanity for years, randomly transforming ordinary people into flaming, violent creatures known as Infernals. While Infernals make up the first-generation accounts of Human Combustion, the second and third generations became known as pyrokinetics—people gifted with the ability to manipulate and control their flames while remaining human. To combat the Infernal threat and discover the cause, the Tokyo Armed Forces, Fire Defense Agency, and Holy Church of Sol produced their answer: the Special Fire Force. Young and eager third-generation pyrokinetic Shinra Kusakabe, nicknamed Devil's Footprints for his explosive ability to ignite his feet at will, becomes a member of the lively Special Fire Force Company 8. Upholding the brigade's duty to extinguish the blazing Infernals and lay their souls to rest, Shinra is determined to become a hero who will save the lives of those threatened by the flame terror. However, this is not the hero's game Shinra imagined. The Fire Force is a fractured mess of feuding brigades, abnormal Infernal sightings are increasing all over Tokyo, and a shadowy group is claiming to have answers to the strange fire that caused the death of Shinra's family 12 years ago. Faced with many obstacles within and outside the Fire Force, Shinra fights to uncover the truth behind the burning mysteries that have kept him in the dark. ",
       "Cast":"",
       "id":"24",
       "arc1":"Season 1 (1-24)",
       "arc2":"Season 2 (25-48)"
  },  
  {
       "rating":"7.6",
       "link":"https://aniwatchtv.to/watch/tower-of-god-866?ep=15024",
       "img":"https://img.flawlessfiles.com/_r/300x400/100/ba/ad/baadf81b77dc17f41ff30610b7efbfc6/baadf81b77dc17f41ff30610b7efbfc6.jpg",
       "img2":"https://upload.wikimedia.org/wikipedia/en/thumb/0/06/Fire_Force%2C_Volume_1.jpg/220px-Fire_Force%2C_Volume_1.jpg",
       "episodes":"13",
       "status":" Finished",
       "name":"Tower of God",
       "Main Character":"25th Bam",
       "category":"Action,Dark-Fantasy",
       "decription":"There is a tower that summons chosen people called 'Regulars' with the promise of granting their deepest desires. Whether it be wealth, fame, authority, or something that surpasses them all—everything awaits those who reach the top. Twenty-Fifth Bam is a boy who had only known a dark cave, a dirty cloth, and an unreachable light his entire life. So when a girl named Rachel came to him through the light, his entire world changed. Becoming close friends with Rachel, he learned various things about the outside world from her. But when Rachel says she must leave him to climb the Tower, his world shatters around him. Vowing to follow after her no matter what it takes, he sets his sight on the tower, and a miracle occurs. Thus begins the journey of Bam, a young boy who was not chosen by the Tower but opened its gates by himself. They call his kind 'Irregulars'—beings that have shaken the very foundation of the Tower each time they set foot inside it. ",
       "Cast":"",
       "id":"25",
       "arc1":"Season 1"
  },
  
  {
       "rating":"7.6",
       "link":"https://aniwatchtv.to/watch/classroom-of-the-elite-713?ep=12865",
       "img":"https://upload.wikimedia.org/wikipedia/en/thumb/5/52/Y%C5%8Dkoso_Jitsuryoku_Shij%C5%8D_Shugi_no_Ky%C5%8Dshitsu_e%2C_Volume_1.jpg/220px-Y%C5%8Dkoso_Jitsuryoku_Shij%C5%8D_Shugi_no_Ky%C5%8Dshitsu_e%2C_Volume_1.jpg",
       "img2":"https://img.flawlessfiles.com/_r/300x400/100/ba/ee/baee528e64275e7da4964d30274d0fe7/baee528e64275e7da4964d30274d0fe7.jpg",
       "episodes":"25",
       "status":" Finished",
       "name":"ClassRoom of The Elites",
       "Main Character":"KiyoTakata Ayanokoji",
       "category":"Psychological Thriller",
       "decription":"  Kyoushitsu e. The third semester kicks off in high gear with a special boot camp deep in the mountains. Forcibly separated into groups along grade and gender lines, the first, second and third years alike must work together to survive the rugged terrain. Even worse? The leader of the group that comes in last will be expelled. Can Class D make it back to campus intact, or is this where they finally say goodbye to one of their own? ",
       "Cast":"",
       "id":"26",
       "arc1":"Season 1 (1-12)",
       "arc2":"Season 2 (13-25)",
       "arc3":"Season 3 (26-36)" 
  },  
  {
       "rating":"/",
       "link":"https://aniwatchtv.to/watch/chainsaw-man-17406?ep=94597",
       "img":"https://img.flawlessfiles.com/_r/300x400/100/b3/da/b3da1326e07269ddd8d73475c5dabf2c/b3da1326e07269ddd8d73475c5dabf2c.jpg",
       "img2":"https://upload.wikimedia.org/wikipedia/en/thumb/2/24/Chainsawman.jpg/220px-Chainsawman.jpg",
       "episodes":"12",
       "status":" Airing",
       "name":"Chainsaw Man",
       "Main Character":"Denji",
       "category":"Action,Comedy Horror,Dark Fantasy",
       "decription":"Denji is robbed of a normal teenage life, left with nothing but his deadbeat father's overwhelming debt. His only companion is his pet, the chainsaw devil Pochita, with whom he slays devils for money that inevitably ends up in the yakuza's pockets. All Denji can do is dream of a good, simple life: one with delicious food and a beautiful girlfriend by his side. But an act of greedy betrayal by the yakuza leads to Denji's brutal, untimely death, crushing all hope of him ever achieving happiness. Remarkably, an old contract allows Pochita to merge with the deceased Denji and bestow devil powers on him, changing him into a hybrid able to transform his body parts into chainsaws. Because Denji's new abilities pose a significant risk to society, the Public Safety Bureau's elite devil hunter Makima takes him in, letting him live as long as he obeys her command. Guided by the promise of a content life alongside an attractive woman, Denji devotes everything and fights with all his might to make his naive dreams a reality. ",
       "Cast":"",
       "id":"27",
       "arc1":"Season 1 (1-12)"
  },  
  {
       "rating":"/",
       "link":"https://aniwatchtv.to/watch/hells-paradise-18332?ep=99938",
       "img":"https://img.flawlessfiles.com/_r/300x400/100/5f/d0/5fd0a7d4f0e1a9088c85bc0dcb2f176a/5fd0a7d4f0e1a9088c85bc0dcb2f176a.png",
       "img2":"https://upload.wikimedia.org/wikipedia/en/thumb/4/4e/Jigokuraku_Vol_1.jpg/220px-Jigokuraku_Vol_1.jpg",
       "episodes":"13",
       "status":" Finished",
       "name":"Hells Paradise",
       "Main Character":"EGabimaru",
       "category":"Action,Dark Fantacy,Psychological Thriller",
       "decription":"Sentenced to death, ninja Gabimaru the Hollow finds himself apathetic. After leading a blood-soaked life, Gabimaru believes he deserves to die. However, every attempt to execute him inexplicably fails. Finally, Sagiri Yamada Asaemon, a fledgling member of a famed executioner clan, is asked to take Gabimaru's life; yet Sagiri makes no move to kill him as requested. Insisting that Gabimaru will not die because of his love for his wife, Sagiri instead offers him the chance to obtain a full pardon for his crimes. If he can travel to the island of Shinsekyo and obtain the Elixir of Life—which supposedly grants immortality—and bring it back for the shogun, then his freedom will be assured. But of the many who have traveled to Shinsekyo in search of the mythical Elixir, not a single person has returned sound of mind, if at all. Though unaware of the numerous dangers ahead, Gabimaru decides to accept the offer—alongside ten other death row convicts—in hope that he and his wife may finally live in peace.",
       "Cast":"",
       "id":"28",
       "arc1":"Season 1 (1-12)"
  },
  {
       "rating":"/",
       "link":"https://aniwatchtv.to/watch/blue-lock-17889?ep=94538",
       "img":"https://img.flawlessfiles.com/_r/300x400/100/fc/ed/fced51e392ffd80041b3a1581ba7de2f/fced51e392ffd80041b3a1581ba7de2f.jpg",
       "img2":"https://upload.wikimedia.org/wikipedia/en/thumb/c/c6/Blue_Lock_manga_volume_1.png/220px-Blue_Lock_manga_volume_1.png",
       "episodes":"24",
       "status":" Airing",
       "name":"Blue Lock",
       "Main Character":"Yoichi Isagi",
       "category":"Sports,Thriller",
       "decription":"Yoichi Isagi was mere moments away from scoring a goal that would have sent his high school soccer team to the nationals, but a split-second decision to pass the ball to his teammate cost him that reality. Bitter, confused, and disappointed, Isagi wonders if the outcome would have been different had he not made the pass. When the young striker returns home, an invitation from the Japan Football Union awaits him. Through an arbitrary and biased decision-making process, Isagi is one of three hundred U-18 strikers selected for a controversial project named Blue Lock. The project's ultimate goal is to turn one of the selected players into the star striker for the Japanese national team. To find the best participant, each diamond in the rough must compete against others through a series of solo and team competitions to rise to the top. Putting aside his ethical objections to the project, Isagi feels compelled to fight his way to the top, even if it means ruthlessly crushing the dreams of 299 aspiring young strikers. ",
       "Cast":"",
       "id":"29",
       "arc1":"Season 1 (1-24)",
       "arc2":"Season 2 (Ongoing)"
  },
  
  {
       "rating":"/",
       "link":"https://aniwatchtv.to/watch/record-of-ragnarok-17390?ep=75731",
       "img":"https://img.flawlessfiles.com/_r/300x400/100/8d/ae/8dae295de544d4f81ec600ae126909cb/8dae295de544d4f81ec600ae126909cb.jpg",
       "img2":"https://upload.wikimedia.org/wikipedia/en/thumb/3/37/Record_of_Ragnarok_volume_1_cover.jpg/220px-Record_of_Ragnarok_volume_1_cover.jpg",
       "episodes":"27",
       "status":" Airing",
       "name":"Record of Ragnarok",
       "Main Character":"Lu Bu",
       "category":"Martial Arts,Dark Fantasy, Adventure",
       "decription":"High above the realm of man, the gods of the world have convened to decide on a single matter: the continued existence of mankind. Under the head of Zeus, the deities of Ancient Greece, Norse mythology, and Hinduism, among others, call assembly every one thousand years to decide the fate of humanity. Because of their unrelenting abuse toward each other and the planet, this time the gods vote unanimously in favor of ending the human race. But before the mandate passes, Brunhild, one of the 13 demigod Valkyries, puts forth an alternate proposal: rather than anticlimactically annihilating mankind, why not give them a fighting chance and enact Ragnarök, a one-on-one showdown between man and god? Spurred on by the audacity of the challenge, the divine council quickly accepts, fully confident that this contest will display the utter might of the gods. To stand a chance against the mighty heavens, Brunhild will need to assemble history's greatest individuals, otherwise the death knell will surely be sounded for mankind.",
       "Cast":"",
       "id":"30",
       "arc1":"Season 1 (1-12)",
       "arc2":"Season 2 (13-27)"
  },
  {
       "rating":"7.9",
       "link":"https://aniwatchtv.to/watch/ninja-kamui-19018?ep=119953",
       "img2":"https://img.flawlessfiles.com/_r/300x400/100/2d/c0/2dc00291c4fcaed8675d6efb7260b916/2dc00291c4fcaed8675d6efb7260b916.jpg",
       "img":"https://upload.wikimedia.org/wikipedia/en/thumb/b/b2/Ninja_Kamui.png/220px-Ninja_Kamui.png",
       "episodes":"13",
       "status":"Finished Airing",
       "name":"Ninja Kamui",
       "Main Character":"Joe Higan",
       "category":"Action,Fiction",
       "decription":"Joe Higan is a Nukenin- a former ninja who escaped his clan and is hiding from his violent past in rural America with his family. One night, he is ambushed by a team of assassins from his former organization who exact a bloody retribution on Joe and his family for betraying their ancient code. Rising from his seeming 'death', Joe will re-emerge as his former self – Ninja Kamui – to avenge his family and friends. Kamui is a 21st century ninja, a shadowy anachronism who pits his ancient skills against high-tech weaponry with brutal finesse. He must face off against trained assassins, combat cyborgs, and rival ninjas to bring down the very clan that made him. ",
       "Cast":"",
       "id":"31",
       "arc1":"Season 1 (1-13)"
  },  
  {
       "rating":"8.7",
       "link":"https://aniwatchtv.to/watch/haikyu-76?ep=1626",
       "img":"https://img.flawlessfiles.com/_r/300x400/100/12/67/126756b57f51180a156a6895b0166643/126756b57f51180a156a6895b0166643.jpg",
       "img2":"https://upload.wikimedia.org/wikipedia/en/thumb/6/6b/Haiky%C5%AB_Volume_1.jpg/220px-Haiky%C5%AB_Volume_1.jpg",
       "episodes":"85",
       "status":" Finished",
       "name":"Haikyu",
       "Main Character":"Shoyo Hinata,Kageyama",
       "category":"Comedy,Sports",
       "decription":"Inspired after watching a volleyball ace nicknamed 'Little Giant' in action, small-statured Shouyou Hinata revives the volleyball club at his middle school. The newly-formed team even makes it to a tournament; however, their first match turns out to be their last when they are brutally squashed by the 'King of the Court,'Tobio Kageyama. Hinata vows to surpass Kageyama, and so after graduating from middle school, he joins Karasuno High School's volleyball team—only to find that his sworn rival, Kageyama, is now his teammate. Thanks to his short height, Hinata struggles to find his role on the team, even with his superior jumping power. Surprisingly, Kageyama has his own problems that only Hinata can help with, and learning to work together appears to be the only way for the team to be successful. Based on Haruichi Furudate's popular shounen manga of the same name, Haikyuu!! is an exhilarating and emotional sports comedy following two determined athletes as they attempt to patch a heated rivalry in order to make their high school volleyball team the best in Japan. ",
       "Cast":"",
       "id":"32",
       "arc1":"Season 1 (25)",
       "arc2":"Season 2 (25)",
       "arc3":"Season 3 (25)"
  },  
  {
       "rating":"8.5",
       "link":"https://aniwatchtv.to/watch/spy-x-family-17977?ep=89506",
       "img":"https://img.flawlessfiles.com/_r/300x400/100/88/bd/88bd17534dc4884f23027035d23d74e5/88bd17534dc4884f23027035d23d74e5.jpg",
       "img2":"https://upload.wikimedia.org/wikipedia/en/thumb/5/51/Spy_Family_vol_1.jpg/220px-Spy_Family_vol_1.jpg",
       "episodes":"37",
       "status":" Airing",
       "name":"Spy X Family",
       "Main Character":"Loid Forger",
       "category":"Action, Spy-Comedy",
       "decription":"For the agent known as 'Twilight' no order is too tall if it is for the sake of peace. Operating as Westalis' master spy, Twilight works tirelessly to prevent extremists from sparking a war with neighboring country Ostania. For his latest mission, he must investigate Ostanian politician Donovan Desmond by infiltrating his son's school: the prestigious Eden Academy. Thus, the agent faces the most difficult task of his career: get married, have a child, and play family. Twilight, or 'Loid Forger,' quickly adopts the unassuming orphan Anya to play the role of a six-year-old daughter and prospective Eden Academy student. For a wife, he comes across Yor Briar, an absent-minded office worker who needs a pretend partner of her own to impress her friends. However, Loid is not the only one with a hidden nature. Yor moonlights as the lethal assassin 'Thorn Princess.' For her, marrying Loid creates the perfect cover. Meanwhile, Anya is not the ordinary girl she appears to be; she is an esper, the product of secret experiments that allow her to read minds. Although she uncovers their true identities, Anya is thrilled that her new parents are cool secret agents! She would never tell them, of course. That would ruin the fun. Under the guise of 'The Forgers,' the spy, the assassin, and the esper must act as a family while carrying out their own agendas. Although these liars and misfits are only playing parts, they soon find that family is about far more than blood relations. ",
       "Cast":"",
       "id":"33",
       "arc1":"Season 1 (25)",
       "arc2":"Season 2 (25)"
  },  
  {
       "rating":"8.6",
       "link":"https://aniwatchtv.to/watch/dragon-ball-509?ep=10218",
       "img":"https://img.flawlessfiles.com/_r/300x400/100/2a/c3/2ac32c050b4dff7747fcc7f64c01edbd/2ac32c050b4dff7747fcc7f64c01edbd.jpg",
       "img2":"https://img.flawlessfiles.com/_r/300x400/100/f1/d8/f1d8865bb1dd83e9d23dc4087c523b28/f1d8865bb1dd83e9d23dc4087c523b28.jpg",
       "episodes":"808",
       "status":" Finished",
       "name":"Dragon Ball",
       "Main Character":"Goku",
       "category":"Martila Arts,Fantasy, Adventure",
       "decription":"SON-Goku is a young boy who lives in the woods all alone—that is, until a girl named Bulma runs into him in her search for a set of magical objects called the 'Dragon Balls.' Since the artifacts are said to grant one wish to whoever collects all seven, Bulma hopes to gather them and wish for a perfect boyfriend. Goku happens to be in possession of a dragon ball, but unfortunately for Bulma, he refuses to part ways with it, so she makes him a deal: he can tag along on her journey if he lets her borrow the dragon ball's power. With that, the two set off on the journey of a lifetime. They don't go on the journey alone. On the way, they meet the old Muten-Roshi and wannabe disciple Kuririn, with whom Goku trains to become a stronger martial artist for the upcoming World Martial Arts Tournament. However, it's not all fun and games; the ability to make any wish come true is a powerful one, and there are others who would do much worse than just wishing for a boyfriend. To stop those who would try to abuse the legendary power, they train to become stronger fighters, using their newfound strength to help the people around them along the way. ",
       "Cast":"",
       "id":"34",
       "arc1":"Classic Series (153)",
       "arc2":"Z Series (291)",
       "arc3":"GT Series (64)",
       "arc4":"Z Kai (94)",
       "arc5":"Z Kai series:Final (69)",
       "arc6":"Dragon Ball Super (131)",
       "arc7":"Super Heroes Dragon BallSeries ()"
  }
     ]
  
}
